### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

In [2]:
#File to Load
#schools csv
schools_csv = "Resources/schools_complete.csv"
school_df = pd.read_csv(schools_csv)

In [3]:
#Look at column names
school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
#students csv
students_csv = "Resources/students_complete.csv"
students_df = pd.read_csv(students_csv)

In [5]:
#Look at column names
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
#make a table with the schools and students dataframes
merge_df = pd.merge(school_df, students_df, on="school_name")
merge_df

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
...,...,...,...,...,...,...,...,...,...,...,...
39165,14,Thomas High School,Charter,1635,1043130,39165,Donna Howard,F,12th,99,90
39166,14,Thomas High School,Charter,1635,1043130,39166,Dawn Bell,F,10th,95,70
39167,14,Thomas High School,Charter,1635,1043130,39167,Rebecca Tanner,F,9th,73,84
39168,14,Thomas High School,Charter,1635,1043130,39168,Desiree Kidd,F,10th,99,90
39169,14,Thomas High School,Charter,1635,1043130,39169,Carolyn Jackson,F,11th,95,75

In [7]:
#Calculate the number of schools
school_count = len(merge_df["school_name"].unique())
school_count

15

In [8]:
#Calculate the number of students
student_count = merge_df["student_name"].count()
student_count

39170

In [9]:
#Calculate the total budget
district_budget = merge_df["budget"].sum()
district_budget

82932329558

In [10]:
#Calculate the average math score
av_math_score = merge_df["math_score"].mean()
av_math_score

78.98537145774827

In [11]:
#Calculate the average reading score
av_reading_score = merge_df["reading_score"].mean()
av_reading_score

81.87784018381414

In [12]:
#Percentage of students passing math

#find the number of students with a math score 70 or over
math_pass_count = merge_df[(merge_df["math_score"] >= 70)].count()["student_name"]

#number of passing math students/total students
math_pass_percentage = math_pass_count/ (student_count) * 100

math_pass_percentage

74.9808526933878

In [13]:
#Percentage of students passing reading

reading_pass_count = merge_df[(merge_df["reading_score"] >= 70)].count()["student_name"]
reading_pass_percentage = reading_pass_count/ (student_count) * 100

reading_pass_percentage

85.80546336482001

In [14]:
#Percentage overall passing
overall_pass_count = merge_df[(merge_df["reading_score"] >= 70) & (merge_df["math_score"] >= 70)].count()["student_name"]


overall_pass_percentage = overall_pass_count/ (student_count) * 100

overall_pass_percentage

65.17232575950983

In [15]:
# add the new columns to the table and clean up the column names
district_summary = pd.DataFrame({"Total Schools": [school_count],
                                 "Total Students": [student_count],
                                 "Total Budget": [district_budget],
                                 "Average Math Score": [av_math_score],
                                 "Average Reading Score": [av_reading_score],
                                 "% of Students Passing Math": [math_pass_percentage],
                                 "% of Students Passing Reading": [reading_pass_percentage],
                                 "% of Students Passing Overall": [overall_pass_percentage]
                                })  

district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% of Students Passing Math,% of Students Passing Reading,% of Students Passing Overall
0,15,39170,82932329558,78.985371,81.87784,74.980853,85.805463,65.172326

In [16]:
#make a table grouped by school name that shows the same info as above for each school
school_types = merge_df.set_index(["school_name"])["type"]

#sum the number of times a school appears in the table, each row is one student
total_students_by_school = merge_df["school_name"].value_counts()

#get the budget for each school and then the buget per student
school_budget = merge_df.groupby(["school_name"]).mean()["budget"]
school_budget_per_capita = school_budget / total_students_by_school

school_types

school_name
Huang High School     District
Huang High School     District
Huang High School     District
Huang High School     District
Huang High School     District
                        ...
Thomas High School     Charter
Thomas High School     Charter
Thomas High School     Charter
Thomas High School     Charter
Thomas High School     Charter
Name: type, Length: 39170, dtype: object

In [17]:
#average math score by school
av_math_score_by_school = merge_df.groupby(["school_name"]).mean()["math_score"]

#average reading score by school
av_reading_score_by_school = merge_df.groupby(["school_name"]).mean()["reading_score"]

#number of students passing math, reading, and passing overall
math_pass_by_school = merge_df[(merge_df["math_score"] >= 70)]

reading_pass_by_school = merge_df[(merge_df["reading_score"] >= 70)]

overall_pass_by_school = merge_df[(merge_df["math_score"] >= 70) & (merge_df["reading_score"] >= 70)]

#get the math, reading, and overall passing percentages by school
math_pass_percent_by_school =math_pass_by_school.groupby(["school_name"]).count()["student_name"] / total_students_by_school * 100

reading_pass_percent_by_school =reading_pass_by_school.groupby(["school_name"]).count()["student_name"] / total_students_by_school * 100

overall_pass_percent_by_school =overall_pass_by_school.groupby(["school_name"]).count()["student_name"] / total_students_by_school * 100

In [18]:
#make the school info table
school_summary = pd.DataFrame({"School Type": [school_types],
                               "Total Students": [total_students_by_school],
                               "Total School Budget": [school_budget],
                               "Per Student Budget": [school_budget_per_capita],
                               "Average Math Score": [av_math_score_by_school],
                               "Average Reading Score": [av_reading_score_by_school],
                               "% Passing Math": [math_pass_percent_by_school],
                               "% Passing Reading": [reading_pass_percent_by_school],
                               "% Overall Passing": [overall_pass_percent_by_school]
                                })  
school_summary

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,school_name Huang High School District Hua...,Bailey High School 4976 Johnson High Sch...,school_name Bailey High School 3124928.0...,Bailey High School 628.0 Cabrera High Sc...,school_name Bailey High School 77.048432...,school_name Bailey High School 81.033963...,Bailey High School 66.680064 Cabrera Hig...,Bailey High School 81.933280 Cabrera Hig...,Bailey High School 54.642283 Cabrera Hig...

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

In [19]:
#show the top 5% of schools
top_schools = school_summary.sort_values(["% Overall Passing"], ascending=False)
top_schools

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,school_name Huang High School District Hua...,Bailey High School 4976 Johnson High Sch...,school_name Bailey High School 3124928.0...,Bailey High School 628.0 Cabrera High Sc...,school_name Bailey High School 77.048432...,school_name Bailey High School 81.033963...,Bailey High School 66.680064 Cabrera Hig...,Bailey High School 81.933280 Cabrera Hig...,Bailey High School 54.642283 Cabrera Hig...

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

In [20]:
#show the bottom 5% of schools
bottom_schools = school_summary.sort_values(["% Overall Passing"], ascending=True)
bottom_schools

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,school_name Huang High School District Hua...,Bailey High School 4976 Johnson High Sch...,school_name Bailey High School 3124928.0...,Bailey High School 628.0 Cabrera High Sc...,school_name Bailey High School 77.048432...,school_name Bailey High School 81.033963...,Bailey High School 66.680064 Cabrera Hig...,Bailey High School 81.933280 Cabrera Hig...,Bailey High School 54.642283 Cabrera Hig...

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [30]:
#separate out the grades
ninth_grade = merge_df[(merge_df["grade"] =="9th")]
tenth_grade = merge_df[(merge_df["grade"] =="10th")]
eleventh_grade = merge_df[(merge_df["grade"] =="11th")]
twelfth_grade = merge_df[(merge_df["grade"] =="12th")]

In [31]:
#group each series by school and get the average math scores
ninth_grade_by_schools = ninth_grade.groupby(["school_name"]).mean()["math_score"]
tenth_grade_by_schools = tenth_grade.groupby(["school_name"]).mean()["math_score"]
eleventh_grade_by_schools = eleventh_grade.groupby(["school_name"]).mean()["math_score"]
twelfth_grade_by_schools = twelfth_grade.groupby(["school_name"]).mean()["math_score"]

In [32]:
scores_by_grade = pd.DataFrame({"9th": ninth_grade_by_schools,
                                "10th": tenth_grade_by_schools,
                                "11th": eleventh_grade_by_schools,
                                "12th": twelfth_grade_by_schools
                
})
scores_by_grade

                             9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [33]:
#group each series by school and get the average reading scores
ninth_grade_by_schools = ninth_grade.groupby(["school_name"]).mean()["reading_score"]
tenth_grade_by_schools = tenth_grade.groupby(["school_name"]).mean()["reading_score"]
eleventh_grade_by_schools = eleventh_grade.groupby(["school_name"]).mean()["reading_score"]
twelfth_grade_by_schools = twelfth_grade.groupby(["school_name"]).mean()["reading_score"]

In [34]:
scores_by_grade = pd.DataFrame({"9th": ninth_grade_by_schools,
                                "10th": tenth_grade_by_schools,
                                "11th": eleventh_grade_by_schools,
                                "12th": twelfth_grade_by_schools
                
})
scores_by_grade

                             9th       10th       11th       12th
school_name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

## Scores by School Size

* Perform the same operations as above, based on school size.

## Scores by School Type

* Perform the same operations as above, based on school type